Locked-Inc/STAR/star-rx72n-firmware/src/tasks/imu_task.c
/* =============================================================================
 * Public Functions
 * =============================================================================
 */

/**
 * @brief Create and start the IMU sensor task
 *
 * @details
 * Creates the ImuTask ThreadX task with priority 13, 2048-byte stack,
 * and auto-start. Returns k_rx_err_invalid_state on double creation.
 *
 * @return rx_err_t Task creation result
 * @retval k_rx_ok Task created and scheduled
 * @retval k_rx_err_invalid_state Called a second time (task already created)
 * @retval k_rx_err_rtos_thread_create ThreadX thread creation failed
 *
 * @pre ThreadX kernel running (tx_application_define context)
 * @pre s_imu_created == false (first call)
 * @post s_imu_created == true
 * @post ImuTask scheduled for execution at priority 13
 *
 * @note Not thread-safe; call from single-threaded tx_application_define() only
 * @note Sensor initialization occurs inside the task (not in this function)
 *
 * @see imu_task.h Header declaration
 * @see internal_imu_task_entry() Task body
 *
 * @since Version 1.0.0
 */
rx_err_t imu_task_create(void)
{
  RX_ASSERT(k_imu_task_stack_size > 0U, "IMU stack size must be non-zero");
  if (s_imu_created) {
    return k_rx_err_invalid_state;
  }

  /* Create event flags group for BNO055 INT signaling */
  const UINT ef_status = tx_event_flags_create(&s_imu_event_flags, "imu_int_flags");
  if (ef_status != TX_SUCCESS) {
    rx_log_error(s_tag, "Failed to create IMU event flags");
    return k_rx_err_rtos_thread_create;
  }

  const UINT tx_status = tx_thread_create(&s_imu_thread,
                                          s_task_name,
                                          internal_imu_task_entry,
                                          (ULONG)k_imu_task_input,
                                          s_imu_stack,
                                          (ULONG)k_imu_task_stack_size,
                                          (UINT)k_imu_task_priority,
                                          (UINT)k_imu_task_priority,
                                          TX_NO_TIME_SLICE,
                                          TX_AUTO_START);

  if (tx_status != TX_SUCCESS) {
    rx_log_error_val(s_tag, "Thread create failed", (uint32_t)tx_status);
    (void)tx_event_flags_delete(&s_imu_event_flags);
    return k_rx_err_rtos_thread_create;
  }

  s_imu_created           = true;
  s_imu_event_flags_ready = true;
  rx_log_info(s_tag, "IMU task created");

  return k_rx_ok;
}

/* =============================================================================
 * Private Functions
 * =============================================================================
 */

/**
 * @brief Send IWDT task heartbeat to prevent watchdog timeout
 *
 * @details
 * Calls rx_iwdt_task_heartbeat() with the "ImuTask" task identifier. Logs
 * any failure. Extracted from the main loop to keep task entry under 60 lines
 * (NASA Rule 4).
 *
 * @pre IWDT subsystem initialized via rx_iwdt_init()
 * @pre s_imu_created == true (task created via imu_task_create())
 * @post Heartbeat recorded; watchdog monitor resets timer for "ImuTask"
 * @post Error logged on failure (watchdog monitor will detect missed heartbeat)
 *
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @see rx_iwdt_task_heartbeat() IWDT heartbeat API
 * @see internal_imu_task_entry() Caller
 *
 * @since Version 1.0.0
 */
static void internal_send_iwdt_heartbeat(void)
{
  RX_ASSERT(s_task_name[0] != '\0', "Task name must not be empty");
  RX_ASSERT(s_imu_created, "IWDT heartbeat called before task created");
  const rx_err_t err = rx_iwdt_task_heartbeat(s_task_name);
  if (err != k_rx_ok) {
    rx_log_error(s_tag, "IWDT heartbeat failed");
  }
}

/**
 * @brief Retry initialization for any sensors that failed initial startup
 *
 * @details
 * Attempts to re-initialize the BNO055 and BMP280 if either failed during
 * internal_imu_task_entry() startup. Sets the corresponding ready flag on
 * success and logs the result. Called each loop iteration until both sensors
 * are ready.
 *
 * @param[in,out] bno_ready Set to true when BNO055 init succeeds on retry
 * @param[in,out] bmp_ready Set to true when BMP280 init succeeds on retry
 *
 * @pre bno_ready non-NULL
 * @pre bmp_ready non-NULL
 * @post *bno_ready == true if BNO055 initialized successfully (this call or prior)
 * @post *bmp_ready == true if BMP280 initialized successfully (this call or prior)
 *
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @see rx_bno055_init() BNO055 initialization
 * @see rx_bmp280_init() BMP280 initialization
 *
 * @since Version 1.0.0
 */
static void internal_retry_sensor_init(bool* bno_ready, bool* bmp_ready)
{
  RX_ASSERT(bno_ready != NULL, "bno_ready must not be NULL");
  RX_ASSERT(bmp_ready != NULL, "bmp_ready must not be NULL");

  if (!*bno_ready) {
    const bno055_config_t bno_cfg   = {.mode = k_bno055_mode_interrupt};
    const rx_err_t        retry_bno = rx_bno055_init(&g_bus_manager, &bno_cfg);
    if (retry_bno == k_rx_ok) {
      *bno_ready = true;
      rx_log_info(s_tag, "BNO055 initialized on retry");
    }
  }
  if (!*bmp_ready) {
    const rx_err_t retry_bmp = rx_bmp280_init(&g_bus_manager);
    if (retry_bmp == k_rx_ok) {
      *bmp_ready = true;
      rx_log_info(s_tag, "BMP280 initialized on retry");
    }
  }
}

/**
 * @brief Read BNO055 and publish imu_state_t to shared data
 *
 * @details
 * Reads all BNO055 fusion outputs (Euler angles, quaternion, linear
 * acceleration, gyroscope, temperature, calibration status) and writes them to
 * shared data via shared_data_update_imu(). Sets valid = false on read
 * failure to signal consumers that data is stale.
 *
 * @pre s_imu_created == true (task running)
 * @pre s_tag != NULL (module tag initialized)
 * @post imu_state_t in shared data updated with latest BNO055 data
 * @post valid = false if BNO055 read fails
 *
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @see shared_data_update_imu() Thread-safe write to shared data
 * @see rx_bno055_read() BNO055 data read
 *
 * @since Version 1.0.0
 */
static void internal_read_and_publish_imu(void)
{
  RX_ASSERT(s_imu_created, "IMU task must be created before reading IMU");
  RX_ASSERT(s_tag != NULL, "s_tag must not be NULL");

  bno055_data_t  bno_data = {0};
  const rx_err_t err      = rx_bno055_read(&bno_data);

  imu_state_t imu  = {0};
  imu.timestamp_ms = internal_ticks_to_ms();

  if (err == k_rx_ok) {
    imu.heading_deg16 = bno_data.heading_deg16;
    imu.roll_deg16    = bno_data.roll_deg16;
    imu.pitch_deg16   = bno_data.pitch_deg16;
    imu.quat_w        = bno_data.quat_w;
    imu.quat_x        = bno_data.quat_x;
    imu.quat_y        = bno_data.quat_y;
    imu.quat_z        = bno_data.quat_z;
    imu.lin_acc_x     = bno_data.lin_acc_x;
    imu.lin_acc_y     = bno_data.lin_acc_y;
    imu.lin_acc_z     = bno_data.lin_acc_z;
    imu.gyro_x_dps16  = bno_data.gyro_x_dps16;
    imu.gyro_y_dps16  = bno_data.gyro_y_dps16;
    imu.gyro_z_dps16  = bno_data.gyro_z_dps16;
    imu.temp_degc     = bno_data.temp_degc;
    imu.calib_stat    = bno_data.calib_stat;
    imu.valid         = true;
  } else {
    rx_log_error_val(s_tag, "BNO055 read failed", (uint32_t)err);
    imu.valid = false;
  }

  const rx_err_t imu_err = shared_data_update_imu(&imu);
  if (imu_err != k_rx_ok) {
    rx_log_error_val(s_tag, "shared_data_update_imu failed", (uint32_t)imu_err);
  }
}

/**
 * @brief Read BMP280 and publish baro_state_t to shared data
 *
 * @details
 * Triggers a forced BMP280 measurement and writes the compensated
 * temperature and pressure to shared data via shared_data_update_baro().
 * Sets valid = false on read failure to signal consumers that data is stale.
 *
 * @pre s_imu_created == true (task running)
 * @pre s_tag != NULL (module tag initialized)
 * @post baro_state_t in shared data updated with latest BMP280 data
 * @post valid = false if BMP280 read fails
 *
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @see shared_data_update_baro() Thread-safe write to shared data
 * @see rx_bmp280_read() BMP280 forced measurement
 *
 * @since Version 1.0.0
 */
static void internal_read_and_publish_baro(void)
{
  RX_ASSERT(s_imu_created, "IMU task must be created before reading baro");
  RX_ASSERT(s_tag != NULL, "s_tag must not be NULL");

  bmp280_data_t  bmp_data = {0};
  const rx_err_t err      = rx_bmp280_read(&bmp_data);

  baro_state_t baro = {0};
  baro.timestamp_ms = internal_ticks_to_ms();

  if (err == k_rx_ok) {
    baro.temp_centi_degc = bmp_data.temp_centi_degc;
    baro.press_pa_256    = bmp_data.press_pa_256;
    baro.valid           = true;
  } else {
    rx_log_error_val(s_tag, "BMP280 read failed", (uint32_t)err);
    baro.valid = false;
  }

  const rx_err_t baro_err = shared_data_update_baro(&baro);
  if (baro_err != k_rx_ok) {
    rx_log_error_val(s_tag, "shared_data_update_baro failed", (uint32_t)baro_err);
  }
}

/**
 * @brief Assert hardware reset on BNO055 via P83 (IMU RST, active-low) before I2C init
 *
 * @details
 * Performs a hardware reset of the BNO055 by toggling P83 (IMU RST, active-low, pin 58)
 * per the BNO055 datasheet and the STAR hardware pinout specification. This guarantees a
 * clean sensor state regardless of the MCU reset type (power-on, warm reset, watchdog).
 *
 * ## Reset Sequence
 *
 * 1. Assert RST LOW (P83 = 0) -- BNO055 enters reset; abort on GPIO failure
 * 2. Wait k_imu_hw_rst_assert_ticks ticks (2 ticks, guaranteed >= 10 ms with +1 slack)
 * 3. Deassert RST HIGH (P83 = 1) -- BNO055 released from reset; abort on GPIO failure
 * 4. Wait k_imu_hw_rst_por_ticks ticks (66 ticks, guaranteed >= 650 ms with +1 slack)
 *
 * Returns k_rx_ok after step 4. Returns the GPIO error code immediately if either
 * gpio_write_low or gpio_write_high fails (steps 1 or 3 respectively).
 *
 * After this function returns k_rx_ok, rx_bno055_init() may proceed immediately with I2C
 * communication. The internal software reset inside rx_bno055_init() is kept as
 * belt-and-suspenders but the hardware reset here is the authoritative reset.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok Reset sequence completed; BNO055 POR done, ready for I2C
 * @retval k_rx_err_hw_init_failed GPIO drive low failed (RST stuck HIGH)
 * @retval k_rx_err_timeout GPIO drive high failed (RST stuck LOW, BNO055 held in reset)
 *
 * @pre s_imu_created == true (imu_task_create() completed)
 * @pre P83 configured as GPIO output by hardware_init.c internal_gpio_init_imu()
 * @post On k_rx_ok: BNO055 has completed POR sequence, ready for I2C communication
 * @post On k_rx_ok: P83 is HIGH (deasserted, BNO055 running)
 * @post On error: P83 state undefined; BNO055 init should be skipped
 *
 * @note Blocks ~670 ms total on success: 20 ms assert + 660 ms POR wait (+1 slack each)
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @warning Must be called before rx_bno055_init(); calling after will disrupt I2C
 * @warning Caller must check return value before proceeding to rx_bno055_init()
 *
 * @see hardware_config.h k_imu_rst_port / k_imu_rst_pin for P83 pin assignment
 * @see rx_port_constants.h k_rx_p8_3 for the combined port/pin constant
 * @see imu_task_hw_rst_t Timing constants for assert and POR delays (with +1 slack)
 * @see rx_bno055_init() Called immediately after this function in internal_imu_task_entry()
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_imu_hardware_reset(void)
{
  RX_ASSERT(s_imu_created, "IMU task must be created before hardware reset");
  RX_ASSERT(s_tag != NULL, "s_tag must not be NULL");

  /* Assert RST LOW -- BNO055 enters hardware reset (active-low) */
  const rx_err_t err_low = gpio_write_low((rx_port_pin_t)k_rx_p8_3);
  if (err_low != k_rx_ok) {
    rx_log_error_val(s_tag, "IMU RST assert low failed", (uint32_t)err_low);
    return err_low;
  }

  /* Hold RST LOW for guaranteed >= 10 ms (+1 tick slack for early wake) */
  (void)tx_thread_sleep((ULONG)k_imu_hw_rst_assert_ticks);

  /* Deassert RST HIGH -- BNO055 released from reset, POR sequence begins */
  const rx_err_t err_high = gpio_write_high((rx_port_pin_t)k_rx_p8_3);
  if (err_high != k_rx_ok) {
    rx_log_error_val(s_tag, "IMU RST deassert high failed", (uint32_t)err_high);
    return err_high;
  }

  /* Wait guaranteed >= 650 ms for BNO055 POR to complete (+1 tick slack) */
  (void)tx_thread_sleep((ULONG)k_imu_hw_rst_por_ticks);

  rx_log_info(s_tag, "BNO055 hardware reset complete");
  return k_rx_ok;
}

/**
 * @brief Block on BNO055 INT event flag with 200 ms watchdog timeout
 *
 * @details
 * Waits for k_imu_event_data_ready to be set in s_imu_event_flags by the
 * INT_IRQ12() ISR. Returns k_imu_wait_data_ready immediately if the flag is
 * already set. Returns k_imu_wait_timeout after k_imu_int_timeout_ticks
 * (200 ms) with no INT -- the caller performs a fault-recovery read.
 * Returns k_imu_wait_rtos_error on any other ThreadX status, indicating that
 * the event-flags group may be corrupted or deleted.
 *
 * @return imu_wait_result_t Three-state result distinguishing INT, timeout, and RTOS fault
 * @retval k_imu_wait_data_ready BNO055 INT fired; event flag consumed
 * @retval k_imu_wait_timeout 200 ms watchdog expired; fault-recovery read
 * @retval k_imu_wait_rtos_error Fatal ThreadX error; caller must escalate
 *
 * @pre s_imu_event_flags created by imu_task_create()
 * @pre Called from task context only (tx_event_flags_get blocks the caller)
 * @post k_imu_event_data_ready cleared from s_imu_event_flags on TX_SUCCESS (TX_OR_CLEAR)
 * @post Caller reads sensors on k_imu_wait_data_ready and k_imu_wait_timeout
 *
 * @note Not thread-safe; called only from internal_imu_task_entry()
 *
 * @see s_imu_event_flags Event flags group set by INT_IRQ12()
 * @see imu_wait_result_t Return type documentation
 * @see internal_imu_task_entry() Sole caller
 *
 * @since Version 1.0.0
 */
static imu_wait_result_t internal_wait_for_imu_int(void)
{
  ULONG      actual_flags = 0U;
  const UINT ef_status    = tx_event_flags_get(&s_imu_event_flags,
                                            (ULONG)k_imu_event_data_ready,
                                            TX_OR_CLEAR,
                                            &actual_flags,
                                            (ULONG)k_imu_int_timeout_ticks);
  if (ef_status == TX_NO_EVENTS) {
    /* Benign watchdog timeout: BNO055 INT did not fire within 200 ms */
    rx_log_warn(s_tag, "IMU INT timeout (200 ms) - reading without INT");
    return k_imu_wait_timeout;
  }
  if (ef_status != TX_SUCCESS) {
    /* Fatal RTOS error: event flags group corrupted or deleted */
    rx_log_error_val(s_tag, "IMU event flags get failed", (uint32_t)ef_status);
    return k_imu_wait_rtos_error;
  }
  return k_imu_wait_data_ready;
}

/**
 * @brief BNO055 INT falling-edge ISR (IRQ12, vector 76, P3.2)
 *
 * @details
 * Invoked by the RX72N ICU on each falling edge of the BNO055 active-low
 * INT signal. Sets k_imu_event_data_ready in s_imu_event_flags to wake the
 * IMU task, then clears the ICU IR flag.
 *
 * ISR execution time: < 1 us at 240 MHz (two register writes + event set).
 *
 * @pre ICU IRQ12 enabled and configured for falling-edge (hardware_init.c)
 * @pre s_imu_event_flags created (imu_task_create() must have run)
 * @post k_imu_event_data_ready bit set in s_imu_event_flags
 * @post IR[76] cleared (ICU interrupt request flag deasserted)
 *
 * @note Runs in interrupt context; must not call blocking ThreadX APIs
 * @note Registered at vector 76 in .rvectors (INTB) table via GNURX naming convention
 * @warning Do not call from task context
 *
 * @see s_imu_event_flags Event flags group signaled by this ISR
 * @see internal_gpio_init_imu_irq() Configures ICU for IRQ12 falling-edge
 * @see internal_imu_task_entry() IMU task that pends on the event flag
 *
 * @since Version 1.0.0
 */
void INT_IRQ12(void);
void INT_IRQ12(void)
{
#ifdef __RX__
  /* Clear ICU interrupt request flag first -- must execute even when the ready
   * guard below returns early.  If a pre-task-create edge fires and the IR bit
   * is not cleared here, the ICU will re-assert the interrupt immediately after
   * the ISR returns, corrupting the still-uninitialized event flags group. */
  icu()->ir[k_imu_irq_vector_isr] = (uint8_t)k_icu_ir_clear_val;
#endif /* __RX__ */

